const doctorsData = [
    {
      "name": "Тихонов Лука Русланович",
      "photo": "assets/img/card-doctor-photo-1.png",
      "specialty": "Диетолог",
      "cost": "1200",
      "child": true,
      "listClinic": [
        {
          "clinic": "Черкизовская",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Преображенская площадь",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Сокольники",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Мещеряков Ярослав Богданович",
      "photo": "assets/img/card-doctor-photo-2.png",
      "specialty": "Андролог",
      "cost": "1500",
      "child": true,
      "listClinic": [
        {
          "clinic": "Красносельская",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Комсомольская",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Красные ворота",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Чистые пруды",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Степанов Андрей Мирославович",
      "photo": "assets/img/card-doctor-photo-3.png",
      "specialty": "Офтальмолг",
      "cost": "2500",
      "child": true,
      "listClinic": [
        {
          "clinic": "Лубянка",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Марьино",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Перово",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Парк культуры",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Фрунзенская",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Сидоров Константин Кириллович",
      "photo": "assets/img/card-doctor-photo-4.png",
      "specialty": "УЗИ диагност",
      "cost": "3200",
      "child": false,
      "listClinic": [
        {
          "clinic": "Черкизовская",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Преображенская площадь",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Королев Тихон Филиппович",
      "photo": "assets/img/card-doctor-photo-5.png",
      "specialty": "Стоматолог",
      "cost": "1800",
      "child": true,
      "listClinic": [
        {
          "clinic": "Сокольники",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Марков Всеволод Ильич",
      "photo": "assets/img/card-doctor-photo-6.png",
      "specialty": "Гематолог",
      "cost": "3700",
      "child": false,
      "listClinic": [
        {
          "clinic": "Красносельская",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Комсомольская",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Красные ворота",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Чистые пруды",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Лубянка",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Марьино",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Алексеев Арсений Даниилович",
      "photo": "assets/img/card-doctor-photo-7.png",
      "specialty": "Генетик",
      "cost": "1650",
      "child": false,
      "listClinic": [
        {
          "clinic": "Перово",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Парк культуры",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Фрунзенская",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Ковалев Савелий Романович",
      "photo": "assets/img/card-doctor-photo-8.png",
      "specialty": "Дерматовенеролог",
      "cost": "2300",
      "child": false,
      "listClinic": [
        {
          "clinic": "Черкизовская",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Преображенская площадь",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Смирнов Даниил Александрович",
      "photo": "assets/img/card-doctor-photo-9.png",
      "specialty": "Кардиолог",
      "cost": "3100",
      "child": true,
      "listClinic": [
        {
          "clinic": "Сокольники",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Шувалов Арсений Маркович",
      "photo": "assets/img/card-doctor-photo-10.png",
      "specialty": "Колопроктолог",
      "cost": "2900",
      "child": false,
      "listClinic": [
        {
          "clinic": "Красносельская",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Комсомольская",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Красные ворота",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Чистые пруды",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Лубянка",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Марьино",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Ильин Леон Маркович",
      "photo": "assets/img/card-doctor-photo-11.png",
      "specialty": "Логопед",
      "cost": "4100",
      "child": false,
      "listClinic": [
        {
          "clinic": "Перово",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Парк культуры",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Фрунзенская",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Васильев Илья Владимирович",
      "photo": "assets/img/card-doctor-photo-12.png",
      "specialty": "Маммолог",
      "cost": "1200",
      "child": true,
      "listClinic": [
        {
          "clinic": "Черкизовская",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Преображенская площадь",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Сокольники",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Алексеев Василий Артурович",
      "photo": "assets/img/card-doctor-photo-13.png",
      "specialty": "Нейрофизиолог",
      "cost": "1500",
      "child": true,
      "listClinic": [
        {
          "clinic": "Красносельская",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Комсомольская",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Красные ворота",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Чистые пруды",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Лубянка",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Васильев Александр Ильич",
      "photo": "assets/img/card-doctor-photo-14.png",
      "specialty": "Нейрохирург",
      "cost": "2500",
      "child": true,
      "listClinic": [
        {
          "clinic": "Марьино",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Перово",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Леонов Владимир Кириллович",
      "photo": "assets/img/card-doctor-photo-15.png",
      "specialty": "Диетолог",
      "cost": "3200",
      "child": false,
      "listClinic": [
        {
          "clinic": "Парк культуры",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Фрунзенская",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Черкизовская",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Кулешова Варвара Петровна",
      "photo": "assets/img/card-doctor-photo-16.png",
      "specialty": "Остеопат",
      "cost": "1800",
      "child": true,
      "listClinic": [
        {
          "clinic": "Преображенская площадь",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Сокольники",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Красносельская",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Комсомольская",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Мельникова Екатерина Семёновна",
      "photo": "assets/img/card-doctor-photo-17.png",
      "specialty": "Пластический хирург",
      "cost": "3700",
      "child": false,
      "listClinic": [
        {
          "clinic": "Красные ворота",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Чистые пруды",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Лубянка",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Марьино",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Перово",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Иванова Мира Артёмовна",
      "photo": "assets/img/card-doctor-photo-18.png",
      "specialty": "Сомнолог",
      "cost": "1650",
      "child": false,
      "listClinic": [
        {
          "clinic": "Парк культуры",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Фрунзенская",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Федорова Валерия Тимофеевна",
      "photo": "assets/img/card-doctor-photo-19.png",
      "specialty": "Трихолог",
      "cost": "2300",
      "child": false,
      "listClinic": [
        {
          "clinic": "Черкизовская",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Грачева Вероника Львовна",
      "photo": "assets/img/card-doctor-photo-20.png",
      "specialty": "Физиотерапевт",
      "cost": "3100",
      "child": true,
      "listClinic": [
        {
          "clinic": "Преображенская площадь",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Сокольники",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Красносельская",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Комсомольская",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Красные ворота",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Чистые пруды",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Румянцева Ева Михайловна",
      "photo": "assets/img/card-doctor-photo-21.png",
      "specialty": "Флеболог",
      "cost": "2900",
      "child": false,
      "listClinic": [
        {
          "clinic": "Лубянка",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Марьино",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Перово",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Суханова Ярослава Демидовна",
      "photo": "assets/img/card-doctor-photo-22.png",
      "specialty": "Терапевт",
      "cost": "4100",
      "child": false,
      "listClinic": [
        {
          "clinic": "Парк культуры",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Фрунзенская",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Блинова Вера Кирилловна",
      "photo": "assets/img/card-doctor-photo-23.png",
      "specialty": "Хирург",
      "cost": "1200",
      "child": false,
      "listClinic": [
        {
          "clinic": "Черкизовская",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Галкина Александра Тимофеевна",
      "photo": "assets/img/card-doctor-photo-24.png",
      "specialty": "Генеколог",
      "cost": "1500",
      "child": true,
      "listClinic": [
        {
          "clinic": "Преображенская площадь",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Сокольники",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Красносельская",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Комсомольская",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Степанова Алия Тимофеевна",
      "photo": "assets/img/card-doctor-photo-25.png",
      "specialty": "Уролог",
      "cost": "2500",
      "child": true,
      "listClinic": [
        {
          "clinic": "Красные ворота",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Чистые пруды",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Лубянка",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Марьино",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Перово",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Борисова Лилия Сергеевна",
      "photo": "assets/img/card-doctor-photo-26.png",
      "specialty": "Дерматовенеролог",
      "cost": "3200",
      "child": true,
      "listClinic": [
        {
          "clinic": "Парк культуры",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Фрунзенская",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Зайцева Алиса Петровна",
      "photo": "assets/img/card-doctor-photo-27.png",
      "specialty": "Кардиолог",
      "cost": "1800",
      "child": false,
      "listClinic": [
        {
          "clinic": "Черкизовская",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Кочетова Полина Даниловна",
      "photo": "assets/img/card-doctor-photo-28.png",
      "specialty": "Колопроктолог",
      "cost": "3700",
      "child": true,
      "listClinic": [
        {
          "clinic": "Преображенская площадь",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        },
        {
          "clinic": "Сокольники",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Красносельская",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Комсомольская",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        },
        {
          "clinic": "Красные ворота",
          "timeJob": [
            {
              "day": "Вс",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Чистые пруды",
          "timeJob": [
            {
              "day": "Чт",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Калинина Анастасия Алиевна",
      "photo": "assets/img/card-doctor-photo-29.png",
      "specialty": "Логопед",
      "cost": "1650",
      "child": false,
      "listClinic": [
        {
          "clinic": "Лубянка",
          "timeJob": [
            {
              "day": "Пн",
              "time": [
                "11-30",
                "12-00",
                "12-30",
                "13-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "12-00",
                "12-30",
                "13-00",
                "13-30"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "12-30",
                "13-00",
                "13-30",
                "14-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "13-00",
                "13-30",
                "14-00",
                "14-30"
              ]
            }
          ]
        },
        {
          "clinic": "Марьино",
          "timeJob": [
            {
              "day": "Пт",
              "time": [
                "13-30",
                "14-00",
                "14-30",
                "15-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "14-00",
                "14-30",
                "15-00",
                "15-30"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "14-30",
                "15-00",
                "15-30",
                "16-00"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "15-00",
                "15-30",
                "16-00",
                "16-30"
              ]
            }
          ]
        },
        {
          "clinic": "Перово",
          "timeJob": [
            {
              "day": "Вт",
              "time": [
                "15-30",
                "16-00",
                "16-30",
                "17-00"
              ]
            },
            {
              "day": "Ср",
              "time": [
                "16-00",
                "16-30",
                "17-00",
                "17-30"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "16-30",
                "17-00",
                "17-30",
                "18-00"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "17-00",
                "17-30",
                "18-00",
                "18-30"
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Тихомирова Арина Александровна",
      "photo": "assets/img/card-doctor-photo-30.png",
      "specialty": "Диетолог",
      "cost": "2300",
      "child": false,
      "listClinic": [
        {
          "clinic": "Парк культуры",
          "timeJob": [
            {
              "day": "Сб",
              "time": [
                "17-30",
                "18-00",
                "18-30",
                "19-00"
              ]
            },
            {
              "day": "Вс",
              "time": [
                "18-00",
                "18-30",
                "19-00",
                "19-30"
              ]
            },
            {
              "day": "Пн",
              "time": [
                "18-30",
                "19-00",
                "19-30",
                "20-00"
              ]
            },
            {
              "day": "Вт",
              "time": [
                "19-00",
                "19-30",
                "20-00",
                "20-30"
              ]
            }
          ]
        },
        {
          "clinic": "Фрунзенская",
          "timeJob": [
            {
              "day": "Ср",
              "time": [
                "09-30",
                "10-00",
                "10-30",
                "11-00"
              ]
            },
            {
              "day": "Чт",
              "time": [
                "10-00",
                "10-30",
                "11-00",
                "11-30"
              ]
            },
            {
              "day": "Пт",
              "time": [
                "10-30",
                "11-00",
                "11-30",
                "12-00"
              ]
            },
            {
              "day": "Сб",
              "time": [
                "11-00",
                "11-30",
                "12-00",
                "12-30"
              ]
            }
          ]
        }
      ]
    }
  ]





export default doctorsData;