const hospitalAddresses = [
    {
        metro: 'Черкизовская',
        addresses: 'г. Москва, ул. Северный проезд, 15а' 
    },
    {
        metro: 'Преображенская площадь',
        addresses: 'г. Москва, ул. Южная, 26'
    },
    {
        metro: 'Сокольники',
        addresses: 'г. Москва, ул. Механизаторов, 48'
    },
    {
        metro: 'Красносельская',
        addresses: 'г. Москва, ул. Октябрьская, 21'
    },
    {
        metro: 'Комсомольская',
        addresses: 'г. Москва, ул. Северная, 12' 
    },
    {
        metro: 'Красные ворота',
        addresses: 'г. Москва, ул. Совхозная, 26' 
    },
    {
        metro: 'Чистые пруды',
        addresses: 'г. Москва, ул. Горького, 14'
    },
    {
        metro: 'Лубянка',
        addresses: 'г. Москва, ул. Комсомольская, 17'
    },
    {
        metro: 'Марьино',
        addresses: 'г. Москва, ул. Чапаева, 5'
    },
    {
        metro: 'Перово',
        addresses: 'г. Москва, ул. Дорожная, 37' 
    },
    {
        metro: 'Парк культуры',
        addresses: 'г. Москва, ул. Зимняя, 2в'
    },
    {
        metro: 'Фрунзенская',
        addresses: 'г. Москва, ул. Строительная, 18'
    }
]


export{hospitalAddresses};























