const servicesPriceDoctors = [
   ['Прием уролога', 1500],
   ['Прием терапефта', 1500],
   ['Прием гастроэнтеролога', 1900],
   ['Прием отоларинголога', 2000],
   ['Прием хирурга', 2000],
   ['Прием гинеколог', 1900],
   ['Прием невролога', 3000],
   ['Прием психиатра', 2700],
   ['Прием ревматолог', 2300],
];


const servicesPriceTests = [
    ['COVID-19', 1200],
    ['OAK', 330],
    ['ОАМ', 350],
    ['Гаптоглобин', 650],
    ['Гомоцистеина', 1920],
    ['Цистатин С', 1500],
    ['Холестирин', 450],
    ['Анти-ТГ', 700],
    ['T-uptake', 500],
    ['Трансферрин', 630],
    ['Ревматоидный фактор', 550],
    ['Щелочная фосфатаза (ЩФ)', 430],
 ];


 const servicesPriceCertificates = [
    ['Справка в бассейн', 1650],
    ['Справка в ГИБДД', 1100],
    ['Справка для вуза', 950],
    ['Справка 086 У', 700],
    ['Справка об эпидокружении', 1920],
    ['Справка 072/у', 1500],
    ['Освобождение от физ-ры', 450],
    ['Справка на оружие 002-оу', 1310],
    ['Справка для иностранных г-н', 1650],
    ['Справка 001-ГС/у', 1350],
 ];


 const servicesPriceInspection = [
    ['Медосмотры сотрудников', 1650],
    ['Выездной медосмотр', 1100],
    ['Предварительный медосмотр', 950],
    ['Медосмотры водителей', 200],
    ['Периодический медосмотр', 1050],
 ];

 const servicesPriceDiagnostics = [
   ['МРТ', 5000],
   ['КТ иследование', 3500],
   ['УЗИ диагностика', 950],
   ['ЭКГ (Электрокардиография)', 1300],
   
];

 export {servicesPriceDoctors, servicesPriceTests, servicesPriceCertificates, servicesPriceInspection, servicesPriceDiagnostics};


 






